In [2]:
import numpy as np
import pandas as pd

In [3]:
df = pd.DataFrame({"name": ['Superman', 'Batman', 'Spiderman'],
                   "toy": [np.nan, 'Batmobile', 'Spiderman toy'],
                   "born": [pd.NaT, pd.Timestamp("1956-06-26"),
                            pd.NaT]})
df

        name            toy       born
0   Superman            NaN        NaT
1     Batman      Batmobile 1956-06-26
2  Spiderman  Spiderman toy        NaT

In [4]:
df.dropna()

     name        toy       born
1  Batman  Batmobile 1956-06-26

In [5]:
df.dropna(axis='columns')

        name
0   Superman
1     Batman
2  Spiderman

In [7]:
df.dropna(axis=1)

        name
0   Superman
1     Batman
2  Spiderman

In [8]:
df.dropna(how='all')

        name            toy       born
0   Superman            NaN        NaT
1     Batman      Batmobile 1956-06-26
2  Spiderman  Spiderman toy        NaT

In [9]:
df.dropna(thresh=2)

        name            toy       born
1     Batman      Batmobile 1956-06-26
2  Spiderman  Spiderman toy        NaT

In [10]:
df.dropna(subset=['name', 'born'])

     name        toy       born
1  Batman  Batmobile 1956-06-26

In [11]:
df.dropna(inplace=True)
df

     name        toy       born
1  Batman  Batmobile 1956-06-26